'''
    У вашій компанії ведеться активна маркетингова кампанія за допомогою SMS-розсилок. Для цього ви збираєте 
    телефонні номери клієнтів із бази даних, але часто стикаєтеся з тим, що номери записані у різних форматах. 

    Ваш сервіс розсилок може ефективно відправляти повідомлення лише тоді, коли номери телефонів представлені у коректному форматі. 
    Тому вам необхідна функція, яка автоматично нормалізує номери телефонів до потрібного формату, видаляючи всі зайві символи та 
    додаючи міжнародний код країни, якщо потрібно.

    Розробіть функцію normalize_phone(phone_number), що нормалізує телефонні номери до стандартного формату, залишаючи 
    тільки цифри та символ '+' на початку. Функція приймає один аргумент - рядок з телефонним номером у будь-якому форматі 
    та перетворює його на стандартний формат, залишаючи тільки цифри та символ '+'. Якщо номер не містить міжнародного коду, 
    функція автоматично додає код '+38' (для України). Це гарантує, що всі номери будуть придатними для відправлення SMS.
    
    Вимоги до завдання:

    Параметр функції phone_number - це рядок з телефонним номером у різноманітних форматах.
    Функція видаляє всі символи, крім цифр та символу '+'.
    Якщо міжнародний код відсутній, функція додає код '+38'. Це враховує випадки, коли номер починається з '380' 
    (додається лише '+') та коли номер починається без коду (додається '+38').
    Функція повертає нормалізований телефонний номер у вигляді рядка.

    Рекомендації для виконання:

    Використовуйте модуль re для регулярних виразів для видалення непотрібних символів.
    Перевірте, чи номер починається з '+', і виправте префікс згідно з вказівками.
    Видаліть всі символи, крім цифр та '+', з номера телефону.
    На забувайте повертати нормалізований номер телефону з функції.
'''

print('===== START ====')
print('')
print('')

def normalize_phone(phone_number):
    print(phone_number)
    
    return ''
    

result = normalize_phone('050-995-59-59')
print(result)


print('')
print('')
print('==== END ====')
